#define _CRT_SECURE_NO_DEPRECATE 1

#include<stdio.h>
//int main()
//{
//	int i = 0, n = 1, sum = 0;
//	for (i = 1; i <=5; i++)
//	{
//		n *= i;
//		sum += n;
//
//	}
//	printf("%d\n", n);
//	return 0;
//}

//int JC(int n)
//{
//	if (n == 1 || n == 0)
//	{
//		return 1;
//	}
//	else
//		return n * JC(n - 1);
//}
//int main()
//{
//	int n = 0;
//	printf("请输入要求的数\n");
//	scanf("%d", &n);
//	printf("%d",JC(n));
//
//	return 0;
//}

//杨辉三角
//int main()
//{
//	int a[5][5];
//	int i = 0, j = 0, sz = sizeof(a) / sizeof(a[0]);
//
//	for (i = 0; i < sz; i++)
//	{
//		a[i][i] = 1;
//		a[i][0] = 1;
//	}
//	for (i = 2; i < sz; i++)
//	{
//		for (j = 1; j < i; j++)
//		{
//			a[i][j] = a[i - 1][j] + a[i - 1][j - 1];
//		}
//	}
//	
//
//	//输出
//	for (i = 0; i < sz; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%2d", a[i][j]);
//		}
//		printf("\n");
//	}
//	return 0;
//}


//菱形

//void Simple(int n)
//{
//	int i = 0, j = 0;
//	//三角形
//	for (i = 0; i < n; i++)
//	{
//		
//		for (j = 0; j < n - 1 - i; j++)
//			printf(" ");
//		for (j = 0; j < 2 * i + 1; j++)
//			printf("*");
//		printf("\n");
//	}
//	//倒三角形
//	for (i = 0; i < n - 1; i++)
//	{
//		for (j = 0; j <= i; j++)
//			printf(" ");
//		for (j = 0; j < 2 * (n - 1-i) -1 ; j++)
//		
//			printf("*");
//		printf("\n");
//	}
//
//
//}
//int main()
//{
//	int n = 0;
//	printf("请输入菱形的行数");
//	scanf("%d", &n);
//	Simple(n);
//
//	return 0;
//}
//
////         *
////        ***    
////       *****
////      *******
////       *****
////        ***
////         *
//#pragma pack(4)
//struct stu {
//	double d;
//	int c;
//	short int a;
//	char b;
//
//};
//
//int main()
//{
//	printf("%d\n", sizeof(int));
//	printf("%d\n", sizeof(unsigned int));
//	printf("%d\n", sizeof(short int));
//	printf("%d\n", sizeof(long int));
//	printf("%d\n", sizeof(long long int));
//	printf("%d\n", sizeof(char));
//	printf("%d\n", sizeof(float));
//	printf("%d\n", sizeof(double));
//	printf("%d\n", sizeof(struct stu));
//	return 0;
//}
//


  //int i=1
  //   0x1       0x2       0x3       0x4 
  //0000 0001 0000 0000 0000 0000 0000 0000 ——>小端
  //0000 0000 0000 0000 0000 0000 0000 0001 ---->大端
  //如果是小端，在(char*)强转时截取地地址处1个字节，所以输出是1；
  //反之输出是 0；
//int check_sys()
//{
//	int i = 1;
//	return (*(char*)&i);
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//		printf("小端\n");
//	
//	else
//		printf("大端\n");
////	return 0;
////}
//
//int main()
//{
//	char a = 128;
//	printf("%d\n", a);
//	return 0;
//}
//1111 1111 -
//1000 0000 -0
//  -128
// 1000 0000
// 1111 1111 1111 1111 1111 1111 1000 0000
// 1111 1111 1111 1111 1111 1111 0111 1111
// 1000 0000 0000 0000 0000 0000 1000 0000


// 1000 0000 0000 0000 0000 0000 0001 0100
// 1111 1111 1111 1111 1111 1111 1110 1011
// 1111 1111 1111 1111 1111 1111 1110 1100 -->-20的补码
//

// 0000 0000 0000 0000 0000 0000 0000 1010  
// 1111 1111 1111 1111 1111 1111 1110 1100 -->-20的补码
// 1111 1111 1111 1111 1111 1111 1111 0110-->
// 1111 1111 1111 1111 1111 1111 1111 0101-->
// 1000 0000 0000 0000 0000 0000 0000 1010-->-10
//-1~-128 128个数
//0~127 128个数
//128~256 128个数
//256 为'\0'不算
//127~0 128
//-1-128=-129
//127 
//-1-129=-130
//126

// 01 0100
// 00 1100
// 01 1000
int main()
{
	/*int i = 20, j = 12;
	printf("%d\n", i^j);*/

	int a = 10, b = 30;
	printf("%d\n",  (a&b)+(a ^ b)/2);
		return 0;
}
//10 20
//10
//01010
//11110
//01010
//10100


//1100 1111 0001 1000 0101 0000 1110 0000
//0000 0000 0000 0000 0000 0000 0000 0000
//1100 1111 0001 1000 0101 0000 1110 0000  |
//0000 0000 0000 0000 0000 0000 0000 0000  &
//1100 1111 0001



